app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    # Saving without session maintenance to skip
    # auto-login which can't happen here because
    # the User has not yet been activated
    if @user.save_without_session_maintenance
---
INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "last_login_at", "email") VALUES('QjzvAqAKRHvVJ3YRgxZM', '2010-03-08 13:53:16', '2010-03-08 13:53:16', 'd29758ea3caff490a377c4cbe83c3b9b6cf7ffe6f58debf88508adb50b70d3b6bcf4e0472af96d782712935fa229b8e0135840a6d656dcdad50b99ff49bc2f05', 'iddz6N-5CyVYG7gd5tee', '2010-03-08 13:53:16', 0, '127.0.0.1', '76wlrtq7pikQIKw65qMj', '2010-03-08 13:53:16', 'fb6bc5f0cc97b4f81ec0f1f151101367cfc083483740b5561e8b65ed6e21d63cc2d7511ef7a44c322e457fa71e2462948cab0583578325a047fc2f023af44369', 1, NULL, NULL, 'potomak84@gmail.com')